'''
author: PengSky
date: 2019-1-11
contain: 项目实战
'''
menu = {
    '161701':{
        'cs':{
            '高级程序语言设计':{
                '学分':'4',
                '成绩':'99',
            },
            '网站设计与制作':{
                '学分': '4',
                '成绩': '99',
            },
            '计算机网络':{
                '学分': '4',
                '成绩': '99',
            },
            '专业英语':{
                '学分': '4',
                '成绩': '99',
            },
        },
        'ee':{
            '高等数学A1': {
                '学分': '4',
                '成绩': '99',
            },
            '工程制图C': {
                '学分': '4',
                '成绩': '99',
            },
            '大学英语Ⅰ': {
                '学分': '4',
                '成绩': '99',
            },
            '思想道德修养与法律基础': {
                '学分': '4',
                '成绩': '99',
            },
        },
    },
    '161702':{
        'cs':{
            '数据结构': {
                '学分': '4',
                '成绩': '99',
            },
            '操作系统': {
                '学分': '4',
                '成绩': '99',
            },
            '计算机组成原理': {
                '学分': '4',
                '成绩': '99',
            },
            'JAVA程序语言设计': {
                '学分': '4',
                '成绩': '99',
            },
        },
        'ee':{
            '高等数学A1': {
                '学分': '4',
                '成绩': '99',
            },
            '线性代数A1': {
                '学分': '4',
                '成绩': '99',
            },
            '大学物理B1': {
                '学分':'4',
                '成绩':'99',},
            '电路分析基础B': {
                '学分': '4',
                '成绩': '99',
            },
        },
    },
    '171801':{
        'cs':{
            '计算机图形学': {
                '学分': '4',
                '成绩': '99',
            },
            '软件工程': {
                '学分': '4',
                '成绩': '99',
            },
            '安全电子商务': {
                '学分': '4',
                '成绩': '99',
            },
            '数据库原理': {
                '学分': '4',
                '成绩': '99',
            },
        },
        'ee':{
            '复变函数': {
                '学分': '4',
                '成绩': '99',
            },
            'C语言程序设计': {
                '学分': '4',
                '成绩': '99',
            },
            '高峰数学A3': {
                '学分': '4',
                '成绩': '99',
            },
            '模拟电子技术': {
                '学分': '4',
                '成绩': '99',
            },
        },
    },
    '171802':{
        'cs': {
            '信息系统管理':{
                '学分': '4',
                '成绩': '99',
            },
        },
        'ee': {
            '高频电子线路': {
                '学分': '4',
                '成绩': '99',
            },
            '自动控制原理': {
                '学分': '4',
                '成绩': '99',
            },
            '电磁场与电磁波': {
                '学分': '4',
                '成绩': '99',
            },
            '数字电子技术': {
                '学分': '4',
                '成绩': '99',
            },
        },
    },
    '181901':{
        'cs': {
            '毕业设计':{
                '学分': '10',
                '成绩': '99',
            },
        },
        'ee': {
            '单片机原理及其应用': {
                '学分': '4',
                '成绩': '99',
            },
            '信号与系统': {
                '学分': '4',
                '成绩': '99',
            },
            '光电技术': {
                '学分': '4',
                '成绩': '99',
            },
            '检测与自动化仪表': {
                '学分': '4',
                '成绩': '99',
            },
        },
    },
}


tag = True
while tag:
    menu1 = menu
    for key in menu1: # 打印第一层
        print(key)

    choice1 = input('输入查询学期>>: ').strip() # 选择第一层

    if choice1 == 'b': # 输入b，则返回上一级
        break
    if choice1 == 'q': # 输入q，则退出整体
        tag = False
        continue
    if choice1 not in menu1: # 输入内容不在menu1内，则继续输入
        continue

    while tag:
        menu_2=menu1[choice1] # 拿到choice1对应的一层字典
        for key in menu_2:
            print(key)

        choice2 = input('输入查询专业>>: ').strip()

        if choice2 == 'b':
            break
        if choice2 == 'q':
            tag = False
            continue
        if choice2 not in menu_2:
            continue

        while tag:
            menu_3=menu_2[choice2]
            for key in menu_3:
                print(key)

            choice3 = input('输入查询课程>>: ').strip()
            if choice3 == 'b':
                break
            if choice3 == 'q':
                tag = False
                continue
            if choice3 not in menu_3:
                continue

            while tag:
                menu_4=menu_3[choice3]
                for key, value in menu_4.items():
                    print('{}:{}'.format(key, value))

                tip4 = input('课程信息信息显示如上\n返回上一级请输入b\n退出请输入q： ').strip()
                if tip4 == 'b':
                    break
                if tip4 == 'q':
                    tag = False
                    continue
                if tip4 not in menu_4:
                    continue
